"""На вход программе поступает строка, состоящая как из заглавных так из строчных букв латинского алфавита.
 Ваша задача преобразовать строку так, чтобы все символы были только заглавными.
Sample Input:
ManY mUcH
Sample Output:
MANY MUCH"""

print(input().upper())

"""На вход программе поступает строка, состоящая как из заглавных так из строчных букв латинского алфавита. Ваша задача преобразовать строку так, чтобы все символы были только строчными
Sample Input:
TheRe is NO spOOn
Sample Output:
there is no spoon"""

print(input().lower())

"""Программиста Тихона попросили написать программу, которая должна была сравнивать две введенные строк
 на равенство, при этом не учитывая регистр букв. Если строки вводились одинаковые, программа Тихона должна
   была печатать True, в противном случае False
Но что-то пошло не так. Тихон написал программу, в которой есть ошибки. Ваша задача исправить
 имеющуюся программу так, чтобы она прошла все тесты. 
Sample Input 1:
Hello
hEllO
Sample Output 1:
True"""