"""Напишите программу, которая выводит фразу «Я стану крутым программистом!» три раза на отдельных строках; 
строки должны быть именно такие, символ в символ!.
Для удобства советую поместить эту фразу в переменную и затем использовать ее при выводе."""
# \n для переноса на новую строку
a = 'Я стану крутым программистом!\n' # на новую строку показывает n
print(a*3)
#s = "Я стану крутым программистом!"
#print(s )

"""Напишите программу, которая напечатает строку, состоящую из 777 букв "W"""
w = "W"
print(w*777)

"""Напишите программу, которая выводит «Лев Николаевич Толстой написал "Война и мир"» (без внешних кавычек)."""
s = 'Лев Николаевич Толстой написал "Война и мир"'
print (s)