"""Напишите программу, которая сначала считывает две фразы по очереди, а потом воспроизводит их
 в той же последовательности,каждую на отдельной строчке."""
a = input()
b = input()
print(a)
print(b)

"""Напишите программу, которая сначала считывает три фразы по очереди,
 а потом воспроизводит их в обратной последовательности, каждую на отдельной строчке."""
a = input()
b = input()
c = input()
print(c)
print(b)
print(a)

"""Напишите программу, которая считывает с клавиатуры слово (или фразу, неважно), 
после чего выводит это же слово четыре раза на одной строке, разделяя их пробелами."""
a = input()
print(a + ' ' + a + ' ' + a + ' '+ a)